Catalogs/питМеню1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>питМеню1</Name>
			<Comment>Товарные списки меню</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.питВидыМеню</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Элемент номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рецептура</Name>
					<Comment>Рецептура</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.питРецептура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВГруппе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выключен</Name>
					<Comment>Отключенные позиции не присутствуют в печати меню</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MRS_КодSimphony</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/питМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питМеню</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Рецептура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.питРецептура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВГруппе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветФонаКнопок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MRS_КодSimphony</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MRS_СтатусСинхронизацииSimphony</Name>
					<Type>
						<v8:Type>cfg:EnumRef.MRS_СтатусыСинхронизацииSimphony</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/питМеню1/Forms/ФормаГруппы/Ext/Form/Module.bsl
// Модуль формы элемента справочника
&НаКлиенте
Перем ЦветФонаПоУмолчанию;    // Цвет фона кнопки, если он явно не задан.
Перем ЗначениеЦветФонаКнопок; // Цвет фона кнопки в виде строки.


&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	ИмяРеквизита = Элемент.Имя;
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "Красный", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "Зеленый", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "Синий", "");
	
	ТекЦвет = Новый Цвет(ЭтаФорма[ИмяРеквизита + "Красный"], ЭтаФорма[ИмяРеквизита + "Зеленый"], ЭтаФорма[ИмяРеквизита + "Синий"]);
	ЗначениеЦветФонаКнопок = ТекЦвет;	
	Объект.ЦветФонаКнопок = ВернутьЦветФонаКнопокСтрокой(ТекЦвет);
	
	Элементы.КнопкаШаблон.ЦветФона = ЗначениеЦветФонаКнопок;
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаКнопокОчистить(Команда)
	ЗначениеЦветФонаКнопок = Новый Цвет(0, 0, 0);
	ЦветФонаКнопкиКрасный  = 0;
	ЦветФонаКнопкиЗеленый  = 0;
	ЦветФонаКнопкиСиний    = 0;
	ЦветФонаКнопок = "";
	Элементы.КнопкаШаблон.ЦветФона = ЗначениеЦветФонаКнопок;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = питОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Наименование");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВернутьЦветФонаКнопокСтрокой(ТекЦвет)
	Возврат ЗначениеВСтрокуВнутр(ТекЦвет);
КонецФункции

&НаСервере
Функция ВернутьЦветФонаКнопокИзСтроки(ТекЦвет)
	Возврат ЗначениеИзСтрокиВнутр(ТекЦвет);
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
// Обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии(Отказ)
	
	ЗначениеЦветФонаКнопок = Новый Цвет(0, 0, 0);
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ЗначениеЦветФонаКнопок = ЦветФонаПоУмолчанию;
		Объект.ЦветФонаКнопок = ВернутьЦветФонаКнопокСтрокой(ЗначениеЦветФонаКнопок);
		ЦветФонаКнопкиКрасный  = ЗначениеЦветФонаКнопок.Красный;
		ЦветФонаКнопкиЗеленый  = ЗначениеЦветФонаКнопок.Зеленый;
		ЦветФонаКнопкиСиний    = ЗначениеЦветФонаКнопок.Синий;
		
	Иначе
		
		ЦветПолучен = Ложь;
		Если НЕ ПустаяСтрока(Объект.ЦветФонаКнопок) Тогда
			Попытка
				ЗначениеЦветФонаКнопок = ВернутьЦветФонаКнопокИзСтроки(Объект.ЦветФонаКнопок);
				ЦветПолучен = Истина;
			Исключение 
				ТекстОшибки = ИнформацияОбОшибке().Описание;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка получения цвета фона кнопки: " + ТекстОшибки;
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли; 
		Если ЦветПолучен Тогда
			ЦветФонаКнопкиКрасный 	= ЗначениеЦветФонаКнопок.Красный;
			ЦветФонаКнопкиЗеленый 	= ЗначениеЦветФонаКнопок.Зеленый;
			ЦветФонаКнопкиСиний 	= ЗначениеЦветФонаКнопок.Синий;
		КонецЕсли; 
		
	КонецЕсли;
	
	Элементы.КнопкаШаблон.ЦветФона = ЗначениеЦветФонаКнопок;
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	питМеню.Ссылка
	|ИЗ
	|	Справочник.питМеню КАК питМеню
	|ГДЕ
	|	питМеню.Родитель В ИЕРАРХИИ(&Родитель)");
	
	Запрос.УстановитьПараметр("Родитель", ТекущийОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаголовокОшибок = "Изменение флага запрещения печати элементов меню в группе """+ТекущийОбъект.Ссылка+""":";
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.Выключен <> ТекущийОбъект.Выключен Тогда
			
			// Установим флаг
			ОбъектМеню = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектМеню.Выключен = ТекущийОбъект.Выключен;
			
			// Отключим проверки при записи
			ОбъектМеню.ОбменДанными.Загрузка = Истина;
			Попытка
				ОбъектМеню.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ЗаголовокОшибок+" Запись меню """+ОбъектМеню+""". "+ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ЦветФонаПоУмолчанию = Новый Цвет(227, 220, 198);
